{
  "data": {
    "activities": [
      {
        "title": "Cruise Halong Bay",
        "activity": "Sure it's touristy, and if you take a boat trip you'll be among a flotilla of dozens of old converted junks, but Halong Bay still remains one of the most impressive natural sights in Southeast Asia, its limestone kart islands jutting dramatically from the sea. Overnight trips are available."
      },
      {
        "title": "Enjoy Ho Chi Minh City",
        "activity": "Gleaming skyscrapers sit side by side with ramshackle buildings and crumbling colonial houses. Monks pass deluxe car showrooms collecting alms. Sun-baked streets heave with honking motorbikes as the Saigon River thrums with small boats and ferries. Our advice? Give yourself plenty of time to take it all in."
      },
      {
        "title": "Escape the heat in Dalat",
        "activity": "To escape the heat of the plains, head for Dalat, a former colonial hill station, reminiscent of a French town. Its faded, elegant villas are evocative of another era. Colonists from Saigon headed to its cool climes, as did the emperor and his entourage. The romantic lakes and alpine scenery are magnets for Vietnamese honeymooners."
      },
      {
        "title": "Explore the Central Highlands",
        "activity": "Dalat is as far as most people go into the Central Highlands but if you head further into the mountains you'll find gorgeous, waterfall-laced hillscapes. The area around Buon Ma Thuot, a coffee-growing region, is a good option - and serves as a reminder that Vietnam is the world's second-largest coffee producer."
      },
      {
        "title": "Get a suit made in Hoi An",
        "activity": "Meander the narrow streets of Hoi An, where tiny shop-houses sit cheek by jowl with riverside bars. It's an obvious place to buy souvenirs - silk items, T-shirts and ceramics are all commonplace - but the headline draw is the chance to have bespoke clothing made by one of the many tailors."
      },
      {
        "title": "Go hiking",
        "activity": "There are hundreds of long distance hiking trails around the country, and a significant infrastructure for visitors wanting guided trekking tours. A strong option? Head south from Hanoi into Cuc Phuong National Park, a wilderness of forest-covered limestone mountains rising up from green rice paddies. It's also home to many rare species and a primate rescue centre."
      },
      {
        "title": "Learn more about the Vietnam War",
        "activity": "It's now more than 40 years since the Vietnam War (known locally as the American War) finished, but is legacy remains tangible. Visitors can tour the DMZ (Demilitarised Zone), walk parts of the one-time supply route known as the Ho Chi Minh Trail, and see tunnels - most notably those at Cu Chi - used in the conflict."
      },
      {
        "title": "Learn to cook",
        "activity": "The food in Vietnam can be astonishingly good. Learn the subtleties of the national cuisine by joining a cookery class - you'll be submerged into the melee of a local market to buy provisions before retreating to a kitchen to prepare (and, naturally, taste) a few dishes. Hoi An and Ho Chi Minh are both good spots to try."
      },
      {
        "title": "Lose yourself in Hanoi",
        "activity": "Hanoi is a hyperactive, sense-spinning whirl of a city, particularly in the maze of narrow lanes and street kitchens in and around the Old Quarter.  Elsewhere, wide, leafy boulevards are lined by colonial buildings in the French quarter. Wherever you are, the background noise is the buzzing of the motorbikes that crowd the capital."
      },
      {
        "title": "Sail the Mekong Delta",
        "activity": "Explore the watery world of the Mekong Delta, where the channels of the mighty Mekong crisscross the land past shimmering emerald paddy fields and sugar cane plantations. Discover riverine towns and floating markets, or try spending the night in a waterside homestay."
      },
      {
        "title": "See Sapa's rice terraces",
        "activity": "In the very north of the country, the one-time French hill station of Sapa is surrounded by hefty alpine scenery, its hills carpeted in spectacular rice terraces. It's also a good place to learn more about some of the hill tribes that still live in the area, most notably the Hmong. Hiking is popular, and village homestays can be arranged."
      },
      {
        "title": "See the country on two wheels",
        "activity": "Motorbike hire is easily arranged in various parts of the country. The vehicles are most commonly Russian-made 125cc Minsks - some travellers even ride the full distance between Hanoi to Ho Chi Minh City. Riddled with all sorts of dangers, not least the vast amount of bikes in the cities, it is nevertheless an exhilarating way to see the country."
      },
      {
        "title": "Taste history in Hué",
        "activity": "The former imperial city of Hue is crammed with wonderful sights. The imposing Imperial Citadel, weathered by the ravages of war and the tropical weather, is slowly being painstakingly renovated. Down at the riverside, meanwhile, you'll find the Thien Mu pagoda, where novice monks peek shyly at the visitors, and the mausoleums of the Emperors, each unique in style."
      },
      {
        "title": "Travel on the Reunification Express",
        "activity": "The rail lines of the so-called Reunification Express run virtually the length of the country, from Hanoi to Ho Chi Minh. 'Express' is a misnomer, however. It can take between 30 and 40 hours to travel between the two cities, so it's advisable to do one section only. Popular is the 18-hour journey between Hanoi and Hue."
      },
      {
        "title": "Unwind on the beach",
        "activity": "The beaches of Vietnam are superb. Nha Trang is the perfect combination of wide, palm-lined sands and lively, bar-lined town - boat trips can take you out to nearby islands and coral reefs. Alternatively, Vung Tau offers superb snorkelling, while Mui Ne is where to head for surfing and adrenaline thrills."
      },
      {
        "title": "Visit the Cao Dai Temple",
        "activity": "Head out to Tay Ninh to view the colourful midday service of the intriguing Cao Dai sect, held in a large temple almost Disney-esque in style. The followers wear red, blue and yellow robes and chant to the accompaniment of a traditional orchestra. The religion combines various beliefs - its saints include Joan of Arc, Buddha, Christ, Muhammad and Victor Hugo."
      }
    ]
  }
}
